# RebarManyLoops Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..RebarManyLoops Property
BuiltInFailures..::..SketchFailures Class See Also
---
Rebar Sketch contains more than one loop. Can't create Rebar.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarManyLoops { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarManyLoops As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarManyLoops {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace